// 12개의 질문을 포함한 하나의 배열과 안에 있는 객체
export const questioncontent = [
  {
    number: 1,
    question: "게임을 플레이할 때, 나는",
    answer1 : "친구들과 함께 게임하는 것이 재미있다.",
    answer2 : "혼자서 조용히 게임에 몰두하는 것이 재미있다.",
    type: "e"
  },

  {
    number: 2,
    question: "일찍 출근을 해야 되는데 게임이 너무 재미있다, 나는",
    answer1 : "아무리 재미있어도 내일의 나를 위해 아쉽지만 자러 간다.",
    answer2 : "내일은 내일의 내가 알아서 할 거다, 오늘의 나는 즐기자",
    type: "s"
  },

  {
    number: 3,
    question: "우연히 재미있어 보이는 게임을 발견했다, 나는",
    answer1 : "리뷰를 꼼꼼히 살펴보며, 게임에 대한 정보들을 찾아본다.",
    answer2 : "리뷰를 신경 쓰지 않으며, 재미있어 보이니 플레이해본다.",
    type: "t"
  },

  {
    number: 4,
    question: "현질 요소가 있는 게임을 할 때, 나는",
    answer1 : "예산을 정하고, 예산을 넘어가면 아무리 좋아 보여도 사지 않는다.",
    answer2 : "예산을 정하지 않고, 갖고 싶은 것이 있다면 충동적으로 구매한다.",
    type: "j"
  },

  {
    number: 5,
    question: "친구가 내가 자주 하는 게임이 어떤지 묻는다, 나는",
    answer1 : "객관적으로 어떠한 게임인지, 게임의 장단점 등 상세히 설명해 준다.",
    answer2 : "주관적으로 게임에 대한 나의 느낌을 말해주고, 같이 할 것을 권한다.",
    type: "e"
  },

  {
    number: 6,
    question: "PC방에 갈 때, 나는",
    answer1 : "친구들이랑 함께 가서, 다 같이 게임하는 것이 좋다.",
    answer2 : "혼자서 조용히 게임하는 것이 편하다.",
    type: "s"
  },

  {
    number: 7,
    question: "게임을 플레이할 시간을 정할 때, 나는",
    answer1 : "하루의 일과를 끝내고, 내가 계획한 시간에 게임을 플레이한다.",
    answer2 : "정해진 시간 없이 내가 게임을 하고 싶을 때 플레이한다.",
    type: "t"
  },

  {
    number: 8,
    question: "팀 게임을 하고 있는데.. 팀원이 트롤링을 한다, 나는",
    answer1 : "곧바로 트롤링을 멈추라고 하며 일침을 가한다.",
    answer2 : "한숨을 쉬며, 참을 만큼 참다가 차단한다.",
    type: "j"
  },

  {
    number: 9,
    question: "게임을 플레이할 캐릭터를 고를 때, 나는",
    answer1 : "외형이 마음에 안 들더라도, 가장 강력한 캐릭터를 고른다.",
    answer2 : "강력한 캐릭터가 아니어도, 외형적으로  가장 마음에 드는 캐릭터를 고른다.",
    type: "e"
  },

  {
    number: 10,
    question: "전략적 게임을 플레이할 때, 나는",
    answer1 : "어떠한 플레이를 할지 전략을 세우며 계획적으로 플레이한다.",
    answer2 : "그때그때 상황에 맞추어서 즉흥적으로 유연하게 플레이한다.",
    type: "s"
  },

  {
    number: 11,
    question: "요즘 게임 관련 인터넷 방송과 유튜브가 핫하다, 나는",
    answer1 : "게임을 직접 플레이하는 것을 즐기지만, 굳이 방송을 챙겨 보진 않는다.",
    answer2 : "게임을 플레이하는 만큼, 게임 방송이나 영상들을 보는 것을 즐긴다.",
    type: "t"
  },

  {
    number: 12,
    question: "게임 내에서 소통이 필요로 할 때, 나는",
    answer1 : "음성 채팅이 편하다.",
    answer2 : "타자로 채팅을 하는 것이 편하다.",
    type: "j"
  },

  {
    number: 13,
    question: "친구의 게임 점수가 많이 떨어졌다, 나는",
    answer1 : "플레이에 문제점들을 파악해 주고, 객관적인 조언을 해준다.",
    answer2 : "친구의 억울함을 들어주며, 위로해준다.",
    type: "e"
  },

  {
    number: 14,
    question: "난이도가 높은 보스를 클리어하기 위해, 나는",
    answer1 : "기존에 있는 공략들을 찾아보며, 최대한 빠르게 클리어한다.",
    answer2 : "다양한 시도들을 해보며, 나만의 공략법을 찾아 클리어한다.",
    type: "s"
  },

  {
    number: 15,
    question: "랭크 게임을 하는데 점수가 자꾸만 떨어진다, 나는",
    answer1 : "나의 플레이를 분석하고 나서 다시 플레이한다.",
    answer2 : "화가 난다. 이 게임은 망겜이 분명하다. 이길 때까지 주야장천 게임을 돌린다.",
    type: "t"
  },

  {
    number: 16,
    question: "오랜만에 여가 시간이 생겼다, 나는",
    answer1 : "친구들과 밖에서 놀거나, 사교 모임에 참석하는 것이 좋다.",
    answer2 : "집에서 게임, 영화, 인터넷 등을 보며 쉬는 것이 좋다.",
    type: "j"
  },

  {
    number: 17,
    question: "게임을 플레이할 캐릭터를 고를 때, 나는",
    answer1 : "후반에는 포텐이 떨어지지만, 초중반에 강력한 캐릭터로 스노우볼을 굴린다.",
    answer2 : "초중반에는 약하지만, 포텐이 높은 후반에 강력한 캐릭터로 왕귀 한다.",
    type: "e"
  },

  {
    number: 18,
    question: "가입할 게임 길드를 찾을 때, 나는",
    answer1 : "랭커를 지향하는 클랜이 좋다.",
    answer2 : "친목을 지향하는 클랜이 좋다.",
    type: "s"
  },

  {
    number: 19,
    question: "가입할 길드를 정하기 위해 규칙을 살펴보고 있다. 나는",
    answer1 : "규칙들이 명확하고 엄격한 목표 지향적인 길드가 좋다.",
    answer2 : "최소한의 규칙으로 자유분방한 분위기의 길드가 좋다.",
    type: "t"
  },

  {
    number: 20,
    question: "게임을 같이 할 파트너를 고를 때, 나는",
    answer1 : "친하지 않더라도, 게임을 잘하며 나를 캐리 해줄 파트너와 같이 한다.",
    answer2 : "게임을 잘 못하더라도, 나와 친한 파트너와 같이한다.",
    type: "j"
  }
]